- To enable magic functions, ipython-sql has to be installed

In [1]:

%load_ext sql
%sql sqlite:///factbook.db

In [2]:
%%sql
SELECT * FROM sqlite_master;

 * sqlite:///factbook.db
Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'facts', 'facts', 47, 'CREATE TABLE "facts" ("id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, "code" varchar(255) NOT NULL, "name" varchar(255) NOT NULL, "area" integer, "a ... (4 characters truncated) ... land" integer, "area_water" integer, "population" integer, "population_growth" float, "birth_rate" float, "death_rate" float, "migration_rate" float)')]

In [6]:
%sql SELECT * FROM sqlite_sequence;

 * sqlite:///factbook.db
Done.

[('facts', 261)]

In [5]:
%%sql
SELECT * 
    FROM facts
LIMIT 5;

 * sqlite:///factbook.db
Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

## Values for the
- minimum population
- maximum population
- minimum population_growth
- maximum population_growth

In [7]:
%%sql 
SELECT MIN(population), MAX(population), 
MIN(population_growth), MAX(population_growth) 
FROM facts;

 * sqlite:///factbook.db
Done.

[(0, 7256490011, 0.0, 4.02)]

In [10]:
%%sql
SELECT name, MIN(population)
    FROM facts;

 * sqlite:///factbook.db
Done.

[('Antarctica', 0)]

In [9]:
%%sql
SELECT name, MAX(population)
    FROM facts;

 * sqlite:///factbook.db
Done.

[('World', 7256490011)]

## Values for the
- minimum population
- maximum population
- minimum population_growth
- maximum population_growth

## excluding the outliers(World and Antarctica)

In [14]:
%%sql 
SELECT MIN(population), MAX(population), 
MIN(population_growth), MAX(population_growth) 
FROM facts
WHERE name NOT IN ('World', 'Antarctica');

 * sqlite:///factbook.db
Done.

[(48, 1367485388, 0.0, 4.02)]

## Values of the Average Population and Average area

In [15]:
%sql SELECT AVG(population), AVG(area) FROM facts;

 * sqlite:///factbook.db
Done.

[(62094928.32231405, 555093.546184739)]

## What Countries have population above the average population and area below the average area

In [18]:
%%sql
SELECT name FROM facts
WHERE population > (SELECT AVG(population) FROM facts) 
AND area < (SELECT AVG(area) FROM facts);

 * sqlite:///factbook.db
Done.

[('Bangladesh',),
 ('Germany',),
 ('Japan',),
 ('Philippines',),
 ('Thailand',),
 ('United Kingdom',),
 ('Vietnam',)]

## What country has the most people?

In [20]:
%%sql
SELECT name, MAX(population) FROM facts
WHERE name <> 'World';

 * sqlite:///factbook.db
Done.

[('China', 1367485388)]

## What country has the highest growth rate?

In [21]:
%%sql
SELECT name, MAX(population_growth) FROM facts;

 * sqlite:///factbook.db
Done.

[('South Sudan', 4.02)]

## Which countries have the highest ratios of water to land?

In [27]:
%%sql
SELECT name, (CAST(area_water as Float) / CAST(area_land as Float)) as area_water_land
FROM facts
ORDER BY area_water_land DESC
LIMIT 10;

 * sqlite:///factbook.db
Done.

[('British Indian Ocean Territory', 905.6666666666666),
 ('Virgin Islands', 4.520231213872832),
 ('Puerto Rico', 0.5547914317925592),
 ('Bahamas, The', 0.3866133866133866),
 ('Guinea-Bissau', 0.2846728307254623),
 ('Malawi', 0.25939625850340137),
 ('Netherlands', 0.22571032366565366),
 ('Uganda', 0.22292237442922375),
 ('Eritrea', 0.16435643564356436),
 ('Liberia', 0.15623961794019933)]

## Which countries have more water than land?

In [31]:
%sql SELECT name FROM facts WHERE area_water > area_land;

 * sqlite:///factbook.db
Done.

[('British Indian Ocean Territory',), ('Virgin Islands',)]

## Which countries will add the most people to their population next year?

In [34]:
%%sql
SELECT name FROM facts
WHERE population_growth > 3.0;

 * sqlite:///factbook.db
Done.

[('Burkina Faso',),
 ('Burundi',),
 ('Malawi',),
 ('Niger',),
 ('Qatar',),
 ('South Sudan',),
 ('Uganda',)]

## Which countries have a higher death rate than birth rate?

In [35]:
%%sql
SELECT name FROM facts
WHERE death_rate > birth_rate;

 * sqlite:///factbook.db
Done.

[('Austria',),
 ('Belarus',),
 ('Bosnia and Herzegovina',),
 ('Bulgaria',),
 ('Croatia',),
 ('Czech Republic',),
 ('Estonia',),
 ('Germany',),
 ('Greece',),
 ('Hungary',),
 ('Italy',),
 ('Japan',),
 ('Latvia',),
 ('Lithuania',),
 ('Moldova',),
 ('Monaco',),
 ('Poland',),
 ('Portugal',),
 ('Romania',),
 ('Russia',),
 ('Serbia',),
 ('Slovenia',),
 ('Ukraine',),
 ('Saint Pierre and Miquelon',)]

## What countries have the highest population/area ratio and how does it compare

In [36]:
%%sql
SELECT name, (CAST(population as Float) / CAST(area as Float)) as population_to_area
FROM facts
ORDER BY population_to_area DESC
LIMIT 10;

 * sqlite:///factbook.db
Done.

[('Macau', 21168.964285714286),
 ('Monaco', 15267.5),
 ('Singapore', 8141.279770444763),
 ('Hong Kong', 6445.041516245487),
 ('Gaza Strip', 5191.819444444444),
 ('Gibraltar', 4876.333333333333),
 ('Bahrain', 1771.8592105263158),
 ('Maldives', 1319.6409395973155),
 ('Malta', 1310.01582278481),
 ('Bermuda', 1299.9259259259259)]